app/Controllers/Compras.php

SELECT *
FROM `compras`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $compras = $this->compras->where('activo',$activo)->findAll();

INSERT INTO `detalle_compra` (`id_compra`, `id_producto`, `nombre`, `cantidad`, `precio`, `fecha_alta`) VALUES (9, '27', 'Tarjeta de video rtx 3050 gygagyte', '30', '2100.00', '2023-01-03 01:34:42')
---
    public function guarda()
    {
        $id_compra = $this->request->getPost('id_compra');
        $total = preg_replace('/[\$,]/', '', $this->request->getPost('total'));

        $session = session();

        $resultadoId = $this->compras->insertaCompra($id_compra, $total, $session->id_usuario);

        $this->temporal_compra = new TemporalCompraModel();

        if($resultadoId){
            $resultadoCompra = $this->temporal_compra->porCompra($id_compra);

            foreach($resultadoCompra as $row){
                $this->detalle_compra->save([
                    'id_compra'     => $resultadoId,
                    'id_producto'   => $row['id_producto'],
                    'nombre'        => $row['nombre'],
                    'cantidad'      => $row['cantidad'],
                    'precio'        => $row['precio'],
                ]);