app/Controllers/Productos.php

    public function index($activo = 1)
    {
        $productos = $this->productos->where('activo',$activo)->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1