app/Controllers/Unidades.php

SELECT *
FROM `unidades`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $unidades = $this->unidades->where('activo',$activo)->findAll();