app/Models/ProductosModel.php

    public function actualizarStock($id_producto, $cantidad, $operador = '+')
    {
        $this->set('existencias', "existencias $operador $cantidad", FALSE);
        $this->where('id', $id_producto);
        $this->update();
---
UPDATE `productos` SET `existencias` = existencias + 30
WHERE `id` = '27'

    public function totalProductos(){
        return $this->where('activo', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `activo` = 1